rlcamp/rp2350_usb_cdc_serial/rp2350_usb_cdc_serial.c
/* Minimum viable low overhead USB CDC ACM I/O for RP2350
 Copyright (c) 2025 Richard Campbell

 Partially derived from dev_lowlevel.c in github.com/raspberrypi.pico-examples
 Copyright (c) 2020 Raspberry Pi (Trading) Ltd.

 SPDX-License-Identifier: BSD-3-Clause
 */

#include "rp2350_usb_cdc_serial.h"

#ifndef USB_MANUFACTURER_NAME
#define USB_MANUFACTURER_NAME "Raspberry Pi"
#endif

#ifndef USB_PRODUCT_NAME
#define USB_PRODUCT_NAME "Pico Test Device"
#endif

/* keep this to 5 characters or less for macos compatibility */
#ifndef USB_SERIAL_PREFIX
#define USB_SERIAL_PREFIX "PICO2"
#endif

/* so that we can reset into bootloader when dtr lowers at 1200 baud */
#include "pico/bootrom.h"

#include "hardware/structs/usb.h"
#include "hardware/regs/usb.h"
#include "hardware/irq.h"
#include "hardware/resets.h"
#include "hardware/sync.h"

/* special macros to modify addresses for set/clear without rmw on rp2350 */
#define usb_hw_set ((usb_hw_t *)hw_set_alias_untyped(usb_hw))
#define usb_hw_clear ((usb_hw_t *)hw_clear_alias_untyped(usb_hw))

#define USB_DIR_OUT 0x00U
#define USB_DIR_IN 0x80U

#define DESCRIPTOR_INTERFACE 0x24

#define USB_TRANSFER_TYPE_CONTROL 0x0
#define USB_TRANSFER_TYPE_BULK 0x2
#define USB_TRANSFER_TYPE_INTERRUPT 0x3

#define USB_DT_DEVICE 0x01
#define USB_DT_CONFIG 0x02
#define USB_DT_STRING 0x03
#define USB_DT_INTERFACE 0x04
#define USB_DT_ENDPOINT 0x05

#define USB_REQUEST_SET_ADDRESS 0x05
#define USB_REQUEST_GET_DESCRIPTOR 0x06
#define USB_REQUEST_SET_CONFIGURATION 0x09

#define USB_DESCRIPTOR_TYPE_ENDPOINT 0x05

#define USB_CONFIG_BUS_POWERED 0x80

#define CDC_SET_LINE_CODING 0x20
#define CDC_GET_LINE_CODING 0x21
#define CDC_SET_CONTROL_LINE_STATE 0x22
#define CDC_SEND_BREAK 0x23

size_t seq_errors = 0;

struct usb_setup_packet {
    uint8_t bmRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} __packed;

struct usb_device_descriptor {
    uint8_t bLength;
    uint8_t bDescriptorType;
    uint16_t bcdUSB;
    uint8_t bDeviceClass;
    uint8_t bDeviceSubClass;
    uint8_t bDeviceProtocol;
    uint8_t bMaxPacketSize0;
    uint16_t idVendor;
    uint16_t idProduct;
    uint16_t bcdDevice;
    uint8_t iManufacturer;
    uint8_t iProduct;
    uint8_t iSerialNumber;
    uint8_t bNumConfigurations;
} __packed;

struct usb_configuration_descriptor {
    uint8_t bLength;
    uint8_t bDescriptorType;
    uint16_t wTotalLength;
    uint8_t bNumInterfaces;
    uint8_t bConfigurationValue;
    uint8_t iConfiguration;
    uint8_t bmAttributes;
    uint8_t bMaxPower;
} __packed;

struct usb_interface_descriptor {
    uint8_t bLength;
    uint8_t bDescriptorType;
    uint8_t bInterfaceNumber;
    uint8_t bAlternateSetting;
    uint8_t bNumEndpoints;
    uint8_t bInterfaceClass;
    uint8_t bInterfaceSubClass;
    uint8_t bInterfaceProtocol;
    uint8_t iInterface;
} __packed;

struct usb_endpoint_descriptor {
    uint8_t bLength;
    uint8_t bDescriptorType;
    uint8_t bEndpointAddress;
    uint8_t bmAttributes;
    uint16_t wMaxPacketSize;
    uint8_t bInterval;
} __packed;

struct interface_association_descriptor {
    uint8_t bLength;
    uint8_t bDescriptorType;
    uint8_t bFirstInterface;
    uint8_t bInterfaceCount;
    uint8_t bFunctionClass;
    uint8_t bFunctionSubClass;
    uint8_t bFunctionProtocol;
    uint8_t iFunction;
} __attribute((packed));

struct cdc_header_functional_descriptor {
    /* usbcdc11.pdf table 26 */
    uint8_t bFunctionLength;
    uint8_t bDescriptorType;
    uint8_t bDescriptorSubtype;
    uint16_t bcdCDC;
} __attribute((packed));

struct union_functional_descriptor {
    /* usbcdc11.pdf table 33 */
    uint8_t bFunctionLength;
    uint8_t bDescriptorType;
    uint8_t bDescriptorSubtype;
    uint8_t bControlInterface;
    uint8_t bSubordinateInterface;
} __attribute((packed));

struct call_management_functional_descriptor {
    /* usbcdc11.pdf table 27 */
    uint8_t bFunctionLength;
    uint8_t bDescriptorType;
    uint8_t bDescriptorSubtype;
    uint8_t bmCapabilities;
    uint8_t bDataInterface;
} __attribute((packed));

struct acm_functional_descriptor {
    /* usbcdc11.pdf table 28 */
    uint8_t bFunctionLength;
    uint8_t bDescriptorType;
    uint8_t bDescriptorSubtype;
    uint8_t bmCapabilities;
} __attribute((packed));

struct cdc_line_info {
    uint32_t dwDTERate;
    uint8_t bCharFormat;
    uint8_t bParityType;
    uint8_t bDataBits;
} __attribute((packed));

#define CDC0_INTERFACE_ACM 0
#define CDC0_INTERFACE_DATA 1
#define CDC1_INTERFACE_ACM 2
#define CDC1_INTERFACE_DATA 3

static unsigned char __attribute((aligned(8))) ep0_buf[64];

static struct usb_endpoint_configuration {
    /* pointers to registers and places in special memory for this endpoint */
    volatile uint32_t * const ep_ctrl;
    volatile uint32_t * const ep_buf_ctrl;
    unsigned char * const dpram_start;

    const unsigned char * in_started, * in_stop;

    /* we need this every time we set ep ctrl */
    const uint8_t transfer_type_bits;

    /* toggles on every packet (unless overridden for ep0) */
    unsigned char next_pid;
} * const ep0_out = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_CONTROL,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[0].out,
    .dpram_start = usb_dpram->ep0_buf_a,
}, * const ep0_in = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_CONTROL,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[0].in,
    .dpram_start = usb_dpram->ep0_buf_a,
}, * const ep1_in = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_INTERRUPT,
    /* note ep_ctrls count from one less than endpoint number */
    .ep_ctrl = &usb_dpram->ep_ctrl[0].in,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[1].in,
    .dpram_start = usb_dpram->epx_data + 1 * 64,
}, * const ep2_out = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_BULK,
    .ep_ctrl = &usb_dpram->ep_ctrl[1].out,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[2].out,
    .dpram_start = usb_dpram->epx_data + 2 * 64,
}, * const ep2_in = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_BULK,
    .ep_ctrl = &usb_dpram->ep_ctrl[1].in,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[2].in,
    .dpram_start = usb_dpram->epx_data + 6 * 64,
}, * const ep3_in = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_INTERRUPT,
    /* note ep_ctrls count from one less than endpoint number */
    .ep_ctrl = &usb_dpram->ep_ctrl[2].in,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[3].in,
    .dpram_start = usb_dpram->epx_data + 3 * 64,
}, * const ep4_out = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_BULK,
    .ep_ctrl = &usb_dpram->ep_ctrl[3].out,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[4].out,
    .dpram_start = usb_dpram->epx_data + 4 * 64,
}, * const ep4_in = &(struct usb_endpoint_configuration) {
    .transfer_type_bits = USB_TRANSFER_TYPE_BULK,
    .ep_ctrl = &usb_dpram->ep_ctrl[3].in,
    .ep_buf_ctrl = &usb_dpram->ep_buf_ctrl[4].in,
    .dpram_start = usb_dpram->epx_data + 5 * 64,
};

static inline uint32_t usb_buffer_offset(const volatile unsigned char * buf) {
    /* return offset within dpram of a given absolute pointer */
    return (uint32_t)buf ^ (uint32_t)usb_dpram;
}

void usb_cdc_serial_deinit(void) {
    irq_set_enabled(USBCTRL_IRQ, false);
    irq_clear(USBCTRL_IRQ);

    /* reset peripheral */
    reset_unreset_block_num_wait_blocking(RESET_USBCTRL);

    hw_set_bits(&usb_hw->sie_ctrl, USB_SIE_CTRL_TRANSCEIVER_PD_BITS);
}

