rlcamp/rp2350_usb_cdc_serial/rp2350_usb_cdc_serial.c
static struct {
    struct cdc_line_info __attribute((aligned(8))) line_info;
    uint8_t line_state;
    unsigned dtr_lockout;
    unsigned char should_set_cdc_line_info;
} cdc_state[2];

_Static_assert(sizeof(cdc_state[0].line_info) == 7, "wtf");

/* does not get reset */
static unsigned dtr_rising_edge_count[2];

static struct {
    size_t filled_now, total_filled, total_drained;
} cdc_rx[2];

static void reset_state(void) {
    memset(&cdc_state, 0, sizeof(cdc_state));
    cdc_rx[0].filled_now = 0;
    cdc_rx[1].filled_now = 0;
    ep2_in->in_stop = NULL;
    ep1_in->next_pid = 0;
    ep2_out->next_pid = 0;
    ep2_in->next_pid = 0;

    ep4_in->in_stop = NULL;
    ep3_in->next_pid = 0;
    ep4_out->next_pid = 0;
    ep4_in->next_pid = 0;
}

void usb_cdc_serial_init(void) {
    /* temporarily disable this until below init is finished */
    irq_set_enabled(USBCTRL_IRQ, false);

    /* reset peripheral */
    reset_unreset_block_num_wait_blocking(RESET_USBCTRL);

    /* clear dpram */
    memset(usb_dpram, 0, sizeof(*usb_dpram));

    /* enable usb pin mux */
    usb_hw->muxing = USB_USB_MUXING_TO_PHY_BITS | USB_USB_MUXING_SOFTCON_BITS;

    /* force vbus detect */
    usb_hw->pwr = USB_USB_PWR_VBUS_DETECT_BITS | USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_BITS;

    /* enable in device mode */
    usb_hw->main_ctrl = USB_MAIN_CTRL_CONTROLLER_EN_BITS;

    /* one interrupt per EP0 transaction (single buffered) */
    usb_hw->sie_ctrl = USB_SIE_CTRL_EP0_INT_1BUF_BITS;

    /* enable interrupts we will react to */
    usb_hw->inte = USB_INTE_BUFF_STATUS_BITS | USB_INTE_BUS_RESET_BITS | USB_INTE_SETUP_REQ_BITS;

    *ep1_in->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                        EP_CTRL_INTERRUPT_PER_BUFFER |
                        (USB_TRANSFER_TYPE_INTERRUPT << EP_CTRL_BUFFER_TYPE_LSB) |
                        usb_buffer_offset(ep1_in->dpram_start));

    *ep2_out->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                         EP_CTRL_INTERRUPT_PER_BUFFER |
                         (USB_TRANSFER_TYPE_BULK << EP_CTRL_BUFFER_TYPE_LSB) |
                         usb_buffer_offset(ep2_out->dpram_start));

    /* TODO: why do we need this? */
    *ep2_in->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                        EP_CTRL_INTERRUPT_PER_BUFFER |
                        (USB_TRANSFER_TYPE_BULK << EP_CTRL_BUFFER_TYPE_LSB) |
                        usb_buffer_offset(ep2_in->dpram_start));

    *ep3_in->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                        EP_CTRL_INTERRUPT_PER_BUFFER |
                        (USB_TRANSFER_TYPE_INTERRUPT << EP_CTRL_BUFFER_TYPE_LSB) |
                        usb_buffer_offset(ep3_in->dpram_start));

    *ep4_out->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                         EP_CTRL_INTERRUPT_PER_BUFFER |
                         (USB_TRANSFER_TYPE_BULK << EP_CTRL_BUFFER_TYPE_LSB) |
                         usb_buffer_offset(ep4_out->dpram_start));

    /* TODO: why do we need this? */
    *ep4_in->ep_ctrl = (EP_CTRL_ENABLE_BITS |
                        EP_CTRL_INTERRUPT_PER_BUFFER |
                        (USB_TRANSFER_TYPE_BULK << EP_CTRL_BUFFER_TYPE_LSB) |
                        usb_buffer_offset(ep4_in->dpram_start));

    /* pull up on dp to indicate full speed */
    usb_hw_set->sie_ctrl = USB_SIE_CTRL_PULLUP_EN_BITS;

    reset_state();

    /* make sure all writes to sram have finished before isr fires */
    __dsb();

    /* enable usb interrupt in nvic */
    irq_set_enabled(USBCTRL_IRQ, true);
}

static void usb_start_out_transfer(struct usb_endpoint_configuration * ep, const size_t len) {
    /* handle a single OUT packet at a time */
    assert(len <= 64);

    const uint32_t val = len | (ep->next_pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID);
    *ep->ep_buf_ctrl = val;
    asm volatile("nop;nop;nop" :::);
    *ep->ep_buf_ctrl = val | USB_BUF_CTRL_AVAIL;

    ep->next_pid ^= 1;
}

void unaligned_memcpy(void * dstv, const void * restrict srcv, size_t count) {
    unsigned char * restrict dst = dstv;
    const unsigned char * restrict src = srcv;

    while (count--)
        *dst++ = *src++;
}

static void usb_double_buffered_in_transfer_continue(struct usb_endpoint_configuration * ep) {
    const size_t len_remaining = ep->in_stop - ep->in_started;
    if (len_remaining >= 64) {
        const size_t len_now = len_remaining < 128 ? len_remaining : 128;

        const uint32_t val_lo = (64 | USB_BUF_CTRL_FULL |
                                 (ep->in_started == ep->dpram_start ? USB_BUF_CTRL_SEL : 0) |
                                 (ep->next_pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID));

        *ep->ep_ctrl = (EP_CTRL_ENABLE_BITS
                        | EP_CTRL_INTERRUPT_PER_DOUBLE_BUFFER
                        | (ep->transfer_type_bits << EP_CTRL_BUFFER_TYPE_LSB)
                        | EP_CTRL_DOUBLE_BUFFERED_BITS
                        | usb_buffer_offset(ep->in_started));
        ep->in_started += len_now;

        ep->next_pid ^= 1;

        const uint32_t val_hi = ((len_now - 64) | USB_BUF_CTRL_FULL |
                                 (ep->in_started == ep->in_stop ? USB_BUF_CTRL_LAST : 0) |
                                 (ep->next_pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID));

        ep->next_pid ^= 1;

        *ep->ep_buf_ctrl = val_hi << 16 | val_lo;
        asm volatile("nop;nop;nop" :::);
        *ep->ep_buf_ctrl = ((val_hi | USB_BUF_CTRL_AVAIL) << 16) | (val_lo | USB_BUF_CTRL_AVAIL);

    } else {
        *ep->ep_ctrl = (EP_CTRL_ENABLE_BITS
                        | EP_CTRL_INTERRUPT_PER_BUFFER
                        | (ep->transfer_type_bits << EP_CTRL_BUFFER_TYPE_LSB)
                        | usb_buffer_offset(ep->in_started));

        const size_t len_now = ep->in_stop - ep->in_started;

        ep->in_started += len_now;

        const uint32_t val_lo = (len_now | USB_BUF_CTRL_FULL | USB_BUF_CTRL_LAST |
                                 (ep->next_pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID));
        ep->next_pid ^= 1;

