rlcamp/rp2350_usb_cdc_serial/rp2350_usb_cdc_serial.c
        *ep->ep_buf_ctrl = val_lo;
        asm volatile("nop;nop;nop" :::);
        *ep->ep_buf_ctrl = val_lo | USB_BUF_CTRL_AVAIL;
    }
}

static void usb_single_buffered_in_transfer_continue(struct usb_endpoint_configuration * ep) {
    const size_t len_remaining = ep->in_stop - ep->in_started;
    const uint16_t len_now = len_remaining < 64 ? len_remaining : 64;
    /* TODO: decide when we need to send a zlp and/or set _LAST */
    const uint32_t val = (len_now | USB_BUF_CTRL_FULL |
                          (ep->next_pid ? USB_BUF_CTRL_DATA1_PID : USB_BUF_CTRL_DATA0_PID));

    unaligned_memcpy(ep->dpram_start, ep->in_started, len_now);
    ep->in_started += len_now;

    ep->next_pid ^= 1;

    *ep->ep_buf_ctrl = val;
    asm volatile("nop;nop;nop" :::);
    *ep->ep_buf_ctrl = val | USB_BUF_CTRL_AVAIL;
}

static void usb_start_in_transfer(struct usb_endpoint_configuration *ep, const void * buf, const size_t len_total) {
    ep->in_started = buf;
    ep->in_stop = ep->in_started + len_total;

    usb_single_buffered_in_transfer_continue(ep);
}

static void usb_handle_device_descriptor(volatile struct usb_setup_packet *pkt) {
    const struct usb_device_descriptor device_descriptor __attribute((aligned(8))) = {
        .bLength = sizeof(struct usb_device_descriptor),
        .bDescriptorType = USB_DT_DEVICE,
        .bcdUSB = 0x200,
        .bDeviceClass = 0xEF, /* misc */
        .bDeviceSubClass = 2, /* common */
        .bDeviceProtocol = 1, /* iad */
        .bMaxPacketSize0 = 64,
        .idVendor = 0x0000,
        .idProduct = 0x0001,
        .bcdDevice = 0x100,
        .iManufacturer = 1,
        .iProduct = 2,
        .iSerialNumber = 3,
        .bNumConfigurations = 1
    };

    usb_start_in_transfer(ep0_in, &device_descriptor,
                          MIN(sizeof(struct usb_device_descriptor), pkt->wLength));
}

static void usb_handle_config_descriptor(volatile struct usb_setup_packet *pkt) {
    /* do a horrible thing to get both packed and aligned buffers */
    static const struct __attribute((aligned(8))) { struct __attribute((packed)) {
        struct usb_configuration_descriptor config;
        struct {
            struct interface_association_descriptor iad;
            struct usb_interface_descriptor cif;
            struct cdc_header_functional_descriptor header;
            struct acm_functional_descriptor acm;
            struct union_functional_descriptor unionfd;
            struct call_management_functional_descriptor call_management;
            struct usb_endpoint_descriptor cifin;
            struct usb_interface_descriptor dif;
            struct usb_endpoint_descriptor in;
            struct usb_endpoint_descriptor out;
        } cdc[2];
    } contents; } __attribute((packed)) config_descriptor_buffer = { .contents = {
        .config = {
            .bLength = sizeof(struct usb_configuration_descriptor),
            .bDescriptorType = USB_DT_CONFIG,
            .wTotalLength = sizeof(config_descriptor_buffer.contents),
            .bNumInterfaces = 4,
            .bConfigurationValue = 1,
            .iConfiguration = 0,
            .bmAttributes = USB_CONFIG_BUS_POWERED,
            .bMaxPower = 100 / 2
        },
        .cdc[0] = {
            .iad = {
                .bLength = sizeof(struct interface_association_descriptor),
                .bDescriptorType = 11,
                .bFirstInterface = 0,
                .bInterfaceCount = 2,
                .bFunctionClass = 0x02,
                .bFunctionSubClass = 0x02,
                .bFunctionProtocol = 0,
                .iFunction = 0
            },
            .cif = {
                /* table 9-12 */
                .bLength = sizeof(struct usb_interface_descriptor),
                .bDescriptorType = USB_DT_INTERFACE,
                .bInterfaceNumber = CDC0_INTERFACE_ACM,
                .bAlternateSetting = 0,
                .bNumEndpoints = 1,
                .bInterfaceClass = 0x02, /* communication interface class */
                .bInterfaceSubClass = 0x02, /* abstract control model */
                .bInterfaceProtocol = 0, /* none */
                .iInterface = 0
            },
            .header = {
                .bFunctionLength = sizeof(struct cdc_header_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x00, /* header functional descriptor from table 25 */
                .bcdCDC = 0x110, /* value for usbcdc11.pdf dated jan 19, 1999 */
            },
            .acm = {
                .bFunctionLength = sizeof(struct acm_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x02, /* acm functional descriptor from table 25 */
                .bmCapabilities = 0b110 /* set line coding, set control line state, get line coding (todo) */
            },
            .unionfd = {
                .bFunctionLength = sizeof(struct union_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x06, /* union functional descriptor from table 25 */
                .bControlInterface = CDC0_INTERFACE_ACM,
                .bSubordinateInterface = CDC0_INTERFACE_DATA
            },
            .call_management = {
                .bFunctionLength = sizeof(struct call_management_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x01, /* call mgmt functional descriptor from table 25 */
                .bmCapabilities = 1, /* handle call */
                .bDataInterface = 1
            },
            .cifin = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 1 | 0x80,
                .bmAttributes = USB_TRANSFER_TYPE_INTERRUPT,
                .wMaxPacketSize = 16,
                .bInterval = 16
            },
            .dif = {
                .bLength = sizeof(struct usb_interface_descriptor),
                .bDescriptorType = USB_DT_INTERFACE,
                .bInterfaceNumber = CDC0_INTERFACE_DATA,
                .bAlternateSetting = 0,
                .bNumEndpoints = 2,
                .bInterfaceClass = 0x0A, /* data interface class (table 18) */
                .bInterfaceSubClass = 0,
                .bInterfaceProtocol = 0,
                .iInterface = 0
            },
            .in = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 2 | 0x00,
                .bmAttributes = USB_TRANSFER_TYPE_BULK,
                .wMaxPacketSize = 64,
                .bInterval = 0
            },
            .out = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 2 | 0x80,
                .bmAttributes = USB_TRANSFER_TYPE_BULK,
                .wMaxPacketSize = 64,
                .bInterval = 0
            }
        },
        .cdc[1] = {
            .iad = {
                .bLength = sizeof(struct interface_association_descriptor),
                .bDescriptorType = 11,
                .bFirstInterface = 2,
                .bInterfaceCount = 2,
                .bFunctionClass = 0x02,
                .bFunctionSubClass = 0x02,
                .bFunctionProtocol = 0,
                .iFunction = 0
            },
            .cif = {
                /* table 9-12 */
                .bLength = sizeof(struct usb_interface_descriptor),
                .bDescriptorType = USB_DT_INTERFACE,
                .bInterfaceNumber = CDC1_INTERFACE_ACM,
                .bAlternateSetting = 0,
                .bNumEndpoints = 1,
                .bInterfaceClass = 0x02, /* communication interface class */
                .bInterfaceSubClass = 0x02, /* abstract control model */
                .bInterfaceProtocol = 0, /* none */
                .iInterface = 0
            },
            .header = {
                .bFunctionLength = sizeof(struct cdc_header_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x00, /* header functional descriptor from table 25 */
                .bcdCDC = 0x110, /* value for usbcdc11.pdf dated jan 19, 1999 */
            },
            .acm = {
                .bFunctionLength = sizeof(struct acm_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x02, /* acm functional descriptor from table 25 */
                .bmCapabilities = 0b110 /* set line coding, set control line state, get line coding (todo) */
            },
            .unionfd = {
                .bFunctionLength = sizeof(struct union_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x06, /* union functional descriptor from table 25 */
                .bControlInterface = CDC1_INTERFACE_ACM,
                .bSubordinateInterface = CDC1_INTERFACE_DATA
            },
            .call_management = {
                .bFunctionLength = sizeof(struct call_management_functional_descriptor),
                .bDescriptorType = DESCRIPTOR_INTERFACE,
                .bDescriptorSubtype = 0x01, /* call mgmt functional descriptor from table 25 */
                .bmCapabilities = 1, /* handle call */
                .bDataInterface = 1
            },
            .cifin = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 3 | 0x80,
                .bmAttributes = USB_TRANSFER_TYPE_INTERRUPT,
                .wMaxPacketSize = 16,
                .bInterval = 16
            },
            .dif = {
                .bLength = sizeof(struct usb_interface_descriptor),
                .bDescriptorType = USB_DT_INTERFACE,
                .bInterfaceNumber = CDC1_INTERFACE_DATA,
                .bAlternateSetting = 0,
                .bNumEndpoints = 2,
                .bInterfaceClass = 0x0A, /* data interface class (table 18) */
                .bInterfaceSubClass = 0,
                .bInterfaceProtocol = 0,
                .iInterface = 0
            },
            .in = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 4 | 0x00,
                .bmAttributes = USB_TRANSFER_TYPE_BULK,
                .wMaxPacketSize = 64,
                .bInterval = 0
            },
            .out = {
                .bLength = sizeof(struct usb_endpoint_descriptor),
                .bDescriptorType = USB_DESCRIPTOR_TYPE_ENDPOINT,
                .bEndpointAddress = 4 | 0x80,
                .bmAttributes = USB_TRANSFER_TYPE_BULK,
                .wMaxPacketSize = 64,
                .bInterval = 0
            }
        }
    }};

    /* host retries this with the actual full length once it knows it */
    const size_t len = (pkt->wLength >= sizeof(config_descriptor_buffer.contents) ? sizeof(config_descriptor_buffer.contents) :
                        pkt->wLength >= sizeof(struct usb_configuration_descriptor) ? sizeof(struct usb_configuration_descriptor) :
                        pkt->wLength);

    usb_start_in_transfer(ep0_in, &config_descriptor_buffer, len);
}

static size_t populate_dt_string(size_t D, unsigned char dest[restrict static D], const char * string) {
    size_t len = 2;
    for (; *string && len < D; len += 2) {
        dest[len + 0] = *string++;
        dest[len + 1] = 0;
    }

    dest[0] = len;
    dest[1] = USB_DT_STRING;
    return len;
}

static void usb_handle_string_descriptor(volatile struct usb_setup_packet *pkt) {
    /* zero if language request, nonzero if string descriptor index */
    unsigned istring = pkt->wValue & 0xff;
    size_t len = 0;

    if (!istring) {
        static const unsigned char lang_descriptor[] = {
            4, /* length */
            USB_DT_STRING,
            0x09, 0x04 /* english */
        };

        len = 4;
        unaligned_memcpy(ep0_buf, lang_descriptor, len);
    }
    else if (1 == istring)
        len = populate_dt_string(sizeof(ep0_buf), ep0_buf, USB_MANUFACTURER_NAME);
    else if (2 == istring)
        len = populate_dt_string(sizeof(ep0_buf), ep0_buf, USB_PRODUCT_NAME);
    else if (3 == istring) {
        rom_get_sys_info_fn func = (rom_get_sys_info_fn)rom_func_lookup(ROM_FUNC_GET_SYS_INFO);
        uint32_t words[9];
        func(words, 9, SYS_INFO_CHIP_INFO);

        char serial_number[sizeof(USB_SERIAL_PREFIX) - 1 + 8 + 1] = USB_SERIAL_PREFIX;
        size_t idest = sizeof(USB_SERIAL_PREFIX) - 1;
        for (size_t inibble = 8; inibble-- > 0; ) {
            const unsigned char c = (words[2] >> (4 * inibble)) & 0xF;
            serial_number[idest++] = (c >= 10) ? ('A' + (c - 10)) : ('0' + c);
        }
        serial_number[idest] = '\0';

        len = populate_dt_string(sizeof(ep0_buf), ep0_buf, serial_number);
    }

    usb_start_in_transfer(ep0_in, ep0_buf, MIN(len, pkt->wLength));
}

