rlcamp/rp2350_usb_cdc_serial/rp2350_usb_cdc_serial.c
static void usb_acknowledge_out_request(void) {
    usb_start_in_transfer(ep0_in, NULL, 0);
}

static unsigned char should_set_dev_addr = 0;
static uint8_t dev_addr = 0;

static int cdc0_dtr_is_high(void) {
    return (*(volatile uint8_t *)&cdc_state[0].line_state) & 0x1;
}

int usb_cdc_serial_dtr_has_gone_low(unsigned rising_edge_count) {
    return !cdc0_dtr_is_high() || *(volatile unsigned *)&dtr_rising_edge_count[0] != rising_edge_count;
}

int usb_cdc_serial_dtr_is_high(unsigned * rising_edge_count_p) {
    if (cdc_state[0].dtr_lockout) return 0;
    if (cdc0_dtr_is_high()) {
        *rising_edge_count_p = *(volatile unsigned *)&dtr_rising_edge_count[0];
        return 1;
    }
    else return 0;
}

int usb_cdc1_serial_dtr_is_high(void) {
    if (cdc_state[1].dtr_lockout) return 0;
    return (*(volatile uint8_t *)&cdc_state[1].line_state) & 0x1;
}

static void usb_handle_setup_packet(void) {
    volatile struct usb_setup_packet * pkt = (volatile struct usb_setup_packet *) &usb_dpram->setup_packet;
    const uint8_t req_direction = pkt->bmRequestType;
    const uint8_t req = pkt->bRequest;
    const size_t iface = pkt->wIndex ? 1 : 0;

    /* ep0 next pid should always be 1 in response to a setup packet */
    ep0_in->next_pid = 1;
    ep0_out->next_pid = 1;

    if (0x21 == req_direction) { /* host to device class interface */
        if (CDC_SET_CONTROL_LINE_STATE == req) {
            /* if the port is closed (DTR goes low...) */
            if ((cdc_state[iface].line_state & 0x01) && !(pkt->wValue & 0x01)) {
                /* and the baud rate is 1200 bps... */
                if (cdc_state[iface].line_info.dwDTERate == 1200)
                /* reset into bootloader */
                    rom_reset_usb_boot_extra(-1, 0, false);
            }

            else if (!(cdc_state[iface].line_state & 0x01) && (pkt->wValue & 0x01)) {
                dtr_rising_edge_count[iface]++;

                /* hack: we need to wait some time between seeing dtr go high and letting
                 calling code know about it */
                cdc_state[iface].dtr_lockout = 200;
                usb_hw_set->inte = USB_INTE_DEV_SOF_BITS;
            }

            cdc_state[iface].line_state = pkt->wValue & 0xFF;
            usb_acknowledge_out_request();
        }
        else if (CDC_SET_LINE_CODING == req) {
            cdc_state[iface].should_set_cdc_line_info = 1;
            usb_start_out_transfer(ep0_out, MIN(pkt->wLength, sizeof(cdc_state[iface].line_info)));
        }
        else
        /* TODO: */
            usb_acknowledge_out_request();
    }
    else if (req_direction == USB_DIR_OUT) {
        if (req == USB_REQUEST_SET_ADDRESS) {
            /* send a zlp as address 0 first, then, when that is acknowledged, set the actual addr */
            dev_addr = (pkt->wValue & 0xff);
            should_set_dev_addr = 1;
            usb_acknowledge_out_request();
        }
        else if (req == USB_REQUEST_SET_CONFIGURATION) {
            usb_acknowledge_out_request();

            /* indicate to host that ep2 out can receive */
            usb_start_out_transfer(ep2_out, 64);
            usb_start_out_transfer(ep4_out, 64);

            __dsb();
        }
        else usb_acknowledge_out_request();
    } else if (req_direction == USB_DIR_IN) {
        if (req == USB_REQUEST_GET_DESCRIPTOR) {
            const uint16_t descriptor_type = pkt->wValue >> 8;

            if (USB_DT_DEVICE == descriptor_type)
                usb_handle_device_descriptor(pkt);
            else if (USB_DT_CONFIG == descriptor_type)
                usb_handle_config_descriptor(pkt);
            else if (USB_DT_STRING == descriptor_type)
                usb_handle_string_descriptor(pkt);
            else {
                /* stall ep0 in, otherwise host thinks we actually want high speed */
                usb_hw_set->ep_stall_arm = USB_EP_STALL_ARM_EP0_IN_BITS;
                *ep0_in->ep_buf_ctrl = USB_BUF_CTRL_STALL;
            }
        }
    }
}

size_t usb_cdc_serial_rx_filled(void) {
    return *(volatile size_t *)&cdc_rx[0].filled_now;
}

void usb_cdc_serial_rx_rearm(void) {
    *(volatile size_t *)&cdc_rx[0].filled_now = 0;
    /* indicate to host that ep2 out can receive */
    usb_start_out_transfer(ep2_out, 64);
}

size_t usb_cdc_serial_rx_bytes_available(void) {
    return *(volatile size_t *)&cdc_rx[0].total_filled - cdc_rx[0].total_drained;
}

unsigned char usb_cdc_serial_rx_next_byte(void) {
    /* it is an error to call this without using the above to know when */
    /* we need not make volatile accesses to the write cursor because we know it will not
     change again until we rearm after reading all of the bytes */
    const unsigned char ret = ep2_out->dpram_start[cdc_rx[0].total_drained++ - (cdc_rx[0].total_filled - usb_cdc_serial_rx_filled())];

    if (cdc_rx[0].total_drained == cdc_rx[0].total_filled)
        usb_cdc_serial_rx_rearm();
    return ret;
}

static void cdc1_rx_rearm(void) {
    *(volatile size_t *)&cdc_rx[1].filled_now = 0;
    /* indicate to host that ep4 out can receive */
    usb_start_out_transfer(ep4_out, 64);
}

size_t usb_cdc1_serial_rx_bytes_available(void) {
    return *(volatile size_t *)&cdc_rx[1].total_filled - cdc_rx[1].total_drained;
}

unsigned char usb_cdc1_serial_rx_next_byte(void) {
    /* it is an error to call this without using the above to know when */
    /* we need not make volatile accesses to the write cursor because we know it will not
     change again until we rearm after reading all of the bytes */
    const unsigned char ret = ep4_out->dpram_start[cdc_rx[1].total_drained++ - (cdc_rx[1].total_filled - *(volatile size_t *)&cdc_rx[1].filled_now)];

    if (cdc_rx[1].total_drained == cdc_rx[1].total_filled)
        cdc1_rx_rearm();
    return ret;
}

int usb_cdc_serial_tx_still_sending(void) {
    return !!(*(void * volatile *)&ep2_in->in_stop);
}

int usb_cdc1_serial_tx_still_sending(void) {
    return !!(*(void * volatile *)&ep4_in->in_stop);
}

void * usb_cdc_serial_tx_acquire(const size_t size_wanted) {
    if (ep2_in->dpram_start + size_wanted > usb_dpram->epx_data + 4096) panic("overflow");
    if (usb_cdc_serial_tx_still_sending()) return NULL;
    return ep2_in->dpram_start;
}

void * usb_cdc_serial_tx_acquire_half(const size_t size_wanted) {
    if (size_wanted > 1792) panic("overflow");
    static unsigned char half = 0;
    half = !half;
    return ep2_in->dpram_start + (half ? 1792 : 0);
}

