rlcamp/rp2350_usb_cdc_serial/rp2350_usb_cdc_serial.c
const void * usb_cdc_serial_rx_staging_area(void) {
    return ep2_out->dpram_start;
}

void usb_cdc_serial_tx_start(const void * pointer, const size_t size) {
    if (!cdc0_dtr_is_high()) return;

    ep2_in->in_started = pointer;
    ep2_in->in_stop = ep2_in->in_started + size;

    usb_double_buffered_in_transfer_continue(ep2_in);
}

void usb_cdc1_serial_tx_start(const void * pointer, const size_t size) {
    if (!usb_cdc1_serial_dtr_is_high()) return;
    usb_start_in_transfer(ep4_in, pointer, size);
}

static unsigned usb_get_endpoint_buff_status_mask(uint8_t addr) {
    return 1U << ((addr & ~USB_DIR_IN) * 2 + !(addr & USB_DIR_IN));
}

static void usb_handle_buff_status(void) {
    const uint32_t buffers = usb_hw->buf_status;
    uint32_t remaining_buffers = buffers;

    const unsigned ep0_in_mask = usb_get_endpoint_buff_status_mask(USB_DIR_IN | 0);
    if (remaining_buffers & ep0_in_mask) {
        usb_hw_clear->buf_status = ep0_in_mask;
        remaining_buffers &= ~ep0_in_mask;

        if (ep0_in->in_started != ep0_in->in_stop)
            usb_single_buffered_in_transfer_continue(ep0_in);
        else {
            if (should_set_dev_addr) {
                usb_hw->dev_addr_ctrl = dev_addr;
                should_set_dev_addr = 0;
            }
            else
            /* receive a zlp from host */
                usb_start_out_transfer(ep0_out, 0);

            ep0_in->in_started = NULL;
            ep0_in->in_stop = NULL;
        }
    }

    const unsigned ep0_out_mask = usb_get_endpoint_buff_status_mask(USB_DIR_OUT | 0);
    if (remaining_buffers & ep0_out_mask) {
        usb_hw_clear->buf_status = ep0_out_mask;
        remaining_buffers &= ~ep0_out_mask;

        for (size_t iface = 0; iface < sizeof(cdc_state) / sizeof(*cdc_state); iface++)
            if (cdc_state[iface].should_set_cdc_line_info) {
                unaligned_memcpy(&cdc_state[iface].line_info, usb_dpram->ep0_buf_a, sizeof(cdc_state[iface].line_info));
                cdc_state[iface].should_set_cdc_line_info = 0;

                /* force next pid because this is technically in response to a setup packet */
                ep0_out->next_pid = 1;
                usb_acknowledge_out_request();
                break;
            }
    }

    const unsigned ep2_in_mask = usb_get_endpoint_buff_status_mask(USB_DIR_IN | 2);
    if (remaining_buffers & ep2_in_mask) {
        usb_hw_clear->buf_status = ep2_in_mask;
        remaining_buffers &= ~ep2_in_mask;

        const unsigned len = (*ep2_in->ep_buf_ctrl) & USB_BUF_CTRL_LEN_MASK;

        if ((ep2_in->in_started != ep2_in->in_stop || 64 == len) && cdc0_dtr_is_high())
            usb_double_buffered_in_transfer_continue(ep2_in);
        else {
            ep2_in->in_started = NULL;
            ep2_in->in_stop = NULL;
            __dsb();
        }
    }

    const unsigned ep2_out_mask = usb_get_endpoint_buff_status_mask(USB_DIR_OUT | 2);
    if (remaining_buffers & ep2_out_mask) {
        usb_hw_clear->buf_status = ep2_out_mask;
        remaining_buffers &= ~ep2_out_mask;

        cdc_rx[0].filled_now = (*ep2_out->ep_buf_ctrl) & USB_BUF_CTRL_LEN_MASK;
        cdc_rx[0].total_filled += cdc_rx[0].filled_now;
        if (!cdc_rx[0].filled_now)
            usb_cdc_serial_rx_rearm();
    }

    const unsigned ep4_in_mask = usb_get_endpoint_buff_status_mask(USB_DIR_IN | 4);
    if (remaining_buffers & ep4_in_mask) {
        usb_hw_clear->buf_status = ep4_in_mask;
        remaining_buffers &= ~ep4_in_mask;

        if (ep4_in->in_started != ep4_in->in_stop && usb_cdc1_serial_dtr_is_high())
            usb_single_buffered_in_transfer_continue(ep4_in);
        else {
            ep4_in->in_started = NULL;
            ep4_in->in_stop = NULL;
            __dsb();
        }
    }

    const unsigned ep4_out_mask = usb_get_endpoint_buff_status_mask(USB_DIR_OUT | 4);
    if (remaining_buffers & ep4_out_mask) {
        usb_hw_clear->buf_status = ep4_out_mask;
        remaining_buffers &= ~ep4_out_mask;

        cdc_rx[1].filled_now = (*ep4_out->ep_buf_ctrl) & USB_BUF_CTRL_LEN_MASK;
        cdc_rx[1].total_filled += cdc_rx[1].filled_now;
        if (!cdc_rx[1].filled_now)
            cdc1_rx_rearm();
    }

    /* TODO: something to handle remaining buffers? */
}

void isr_usbctrl(void) {
    const uint32_t status = usb_hw->ints;
    uint32_t handled = 0;

    if (status & USB_INTS_SETUP_REQ_BITS) {
        handled |= USB_INTS_SETUP_REQ_BITS;
        usb_hw_clear->sie_status = USB_SIE_STATUS_SETUP_REC_BITS;
        usb_handle_setup_packet();
    }

    if (status & USB_INTS_BUFF_STATUS_BITS) {
        handled |= USB_INTS_BUFF_STATUS_BITS;
        usb_handle_buff_status();
    }

    if (status & USB_INTS_BUS_RESET_BITS) {
        handled |= USB_INTS_BUS_RESET_BITS;
        usb_hw_clear->sie_status = USB_SIE_STATUS_BUS_RESET_BITS;

        reset_state();
        dev_addr = 0;
        usb_hw->dev_addr_ctrl = 0;
    }

    if (status & USB_INTS_DEV_SOF_BITS) {
        handled |= USB_INTS_DEV_SOF_BITS;
        (void)usb_hw->sof_rd; /* reading this register seems to be required */

        if (cdc_state[0].dtr_lockout) cdc_state[0].dtr_lockout--;
        if (cdc_state[1].dtr_lockout) cdc_state[1].dtr_lockout--;

        if (!cdc_state[0].dtr_lockout && !cdc_state[1].dtr_lockout)
            usb_hw_clear->inte = USB_INTE_DEV_SOF_BITS;
    }

    if (usb_hw->sie_status & USB_SIE_STATUS_DATA_SEQ_ERROR_BITS) {
        usb_hw_clear->sie_status = USB_SIE_STATUS_DATA_SEQ_ERROR_BITS;
        seq_errors++;
    }

    if (status ^ handled)
        panic("unhandled irq(s): 0x%x\r\n", (uint) (status ^ handled));
}

const char * get_line_from_usb_cdc(void) {
    /* convenience function, always returns NULL or a complete line in a C string */
    static char linebuf[128] = { 0 }; /* max line length, ought to be enough for anyone */
    static size_t ilinebuf = 0;

    __dsb();
    /* if there any bytes still sitting in ep sram... */
    for (size_t bytes = usb_cdc_serial_rx_bytes_available(); bytes; bytes--) {
        /* consume one byte from ep sram */
        const unsigned char byte = usb_cdc_serial_rx_next_byte();

        /* only advance the cursor if not already full */
        if (ilinebuf < sizeof(linebuf)) linebuf[ilinebuf++] = byte;

        /* treat either line ending identically, and ignore duplicates/empty lines */
        if ('\r' == byte || '\n' == byte) {
            /* if overflow occurred, discard the partial line */
            if (byte != linebuf[ilinebuf - 1]) ilinebuf = 1;

            /* overwrite whichever line ending we got with a zero termination */
            linebuf[ilinebuf - 1] = '\0';

            /* reset cursor */
            ilinebuf = 0;

            /* if the line ending in this newline was nonempty, return it */
            if (linebuf[0] != '\0') return linebuf;
        }
    }

    return NULL;
}

const char * get_line_from_usb_cdc1(void) {
    /* TODO: consolidate this with above? */
    /* convenience function, always returns NULL or a complete line in a C string */
    static char linebuf[128] = { 0 }; /* max line length, ought to be enough for anyone */
    static size_t ilinebuf = 0;

    __dsb();
    /* if there any bytes still sitting in ep sram... */
    for (size_t bytes = usb_cdc1_serial_rx_bytes_available(); bytes; bytes--) {
        /* consume one byte from ep sram */
        const unsigned char byte = usb_cdc1_serial_rx_next_byte();

        /* only advance the cursor if not already full */
        if (ilinebuf < sizeof(linebuf)) linebuf[ilinebuf++] = byte;

        /* treat either line ending identically, and ignore duplicates/empty lines */
        if ('\r' == byte || '\n' == byte) {
            /* if overflow occurred, discard the partial line */
            if (byte != linebuf[ilinebuf - 1]) ilinebuf = 1;

            /* overwrite whichever line ending we got with a zero termination */
            linebuf[ilinebuf - 1] = '\0';

            /* reset cursor */
            ilinebuf = 0;

            /* if the line ending in this newline was nonempty, return it */
            if (linebuf[0] != '\0') return linebuf;
        }
    }

    return NULL;
}
